#language: ru
Функция: Решение квадратного уравнения
Сценарий: Если дискриминант квадратного уравнения больше 0, то квадратное уравнение имеет два корня кратности 1
    Дано Квадратное уравнение с коэффициентами (1, 0, -1)
    Когда вычисляются корни квадратного уравнения
    Тогда квадратное уравнение имеет два корня (1, -1) кратности один  

Сценарий: Если дискриминант квадратного уравнения равен 0, то квадратное уравнение имеет один корень кратности 2
    Дано Квадратное уравнение с коэффициентами (1, -2, 1)
    Когда вычисляются корни квадратного уравнения
    Тогда квадратное уравнение имеет один корень 1 кратности два
